## Basics & Math

In [28]:
import pandas as pd

#### read the csv

In [29]:
df_cs = pd.read_csv('ComputerSales.csv')
df_cs.tail()

,Sale ID,Contact,Sex,Age,State,Product ID,Product Type,Sale Price,Profit,Lead,Month,Year
34,35,Michelle Samms,F,46,NY,MY2J2LL,Tablet,999.99,146.69,Website,April,2020
35,36,Sally Struthers,F,45,NY,81TC00,Laptop,649.99,122.34,Website,April,2020
36,37,Jason Case,M,57,PA,M01-F0024,Desktop,479.99,143.39,Flyer 4,April,2020
37,38,Doug Johnson,M,51,PA,GA401IV,Laptop,1349.99,180.34,Website,May,2020
38,39,Moe Eggert,M,35,PA,I3593,Laptop,399.99,72.09,Website,May,2020

In [30]:
df_cs.head()

,Sale ID,Contact,Sex,Age,State,Product ID,Product Type,Sale Price,Profit,Lead,Month,Year
0,1,Paul Thomas,M,43,OH,M01-F0024,Desktop,479.99,143.39,Website,January,2018
1,2,Margo Simms,F,37,WV,GT13-0024,Desktop,1249.99,230.89,Flyer 4,January,2018
2,3,Sam Stine,M,26,PA,I3670,Desktop,649.99,118.64,Website,February,2018
3,4,Moe Eggert,M,35,PA,I3593,Laptop,399.99,72.09,Website,March,2018
4,5,Jessica Elk,F,55,PA,15M-ED,Laptop,699.99,98.09,Flyer 4,March,2018

##### a slice of first two

In [31]:
df_cs[:2]

,Sale ID,Contact,Sex,Age,State,Product ID,Product Type,Sale Price,Profit,Lead,Month,Year
0,1,Paul Thomas,M,43,OH,M01-F0024,Desktop,479.99,143.39,Website,January,2018
1,2,Margo Simms,F,37,WV,GT13-0024,Desktop,1249.99,230.89,Flyer 4,January,2018

In [32]:
df_cs[:5:2]   ### step 2

,Sale ID,Contact,Sex,Age,State,Product ID,Product Type,Sale Price,Profit,Lead,Month,Year
0,1,Paul Thomas,M,43,OH,M01-F0024,Desktop,479.99,143.39,Website,January,2018
2,3,Sam Stine,M,26,PA,I3670,Desktop,649.99,118.64,Website,February,2018
4,5,Jessica Elk,F,55,PA,15M-ED,Laptop,699.99,98.09,Flyer 4,March,2018

In [33]:
### get index; note this is a numpy array, an n-D general data structure while 
### DataFrame in Pandas is specialized 2-D data structure; 
### since pandas is built on numpy, dataframes are collection of numpy arrays
### the renaming was done in 2023: https://github.com/pandas-dev/pandas/issues/53694
df_cs.index.array

<NumpyExtensionArray>
[ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17, 18,
 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37,
 38]
Length: 39, dtype: int64

In [34]:
### showing that dataframes are collection of numpy arrays
### for a quick comparison between numpy array and list: https://www.geeksforgeeks.org/python-lists-vs-numpy-arrays/
df_cs.to_numpy()

array([[1, 'Paul Thomas', 'M', 43, 'OH', 'M01-F0024', 'Desktop', 479.99,
        143.39, 'Website', 'January', 2018],
       [2, 'Margo Simms', 'F', 37, 'WV', 'GT13-0024', 'Desktop', 1249.99,
        230.89, 'Flyer 4', 'January', 2018],
       [3, 'Sam Stine', 'M', 26, 'PA', 'I3670', 'Desktop', 649.99,
        118.64, 'Website', 'February', 2018],
       [4, 'Moe Eggert', 'M', 35, 'PA', 'I3593', 'Laptop', 399.99, 72.09,
        'Website', 'March', 2018],
       [5, 'Jessica Elk', 'F', 55, 'PA', '15M-ED', 'Laptop', 699.99,
        98.09, 'Flyer 4', 'March', 2018],
       [6, 'Sally Struthers', 'F', 45, 'PA', 'GT13-0024', 'Desktop',
        1249.99, 230.89, 'Flyer 2', 'April', 2018],
       [7, 'Michelle Samms', 'F', 46, 'OH', 'GA401IV', 'Laptop', 1349.99,
        180.34, 'Email', 'May', 2018],
       [8, 'Mick Roberts', 'M', 23, 'OH', 'MY2J2LL', 'Tablet', 999.99,
        146.69, 'Website', 'July', 2018],
       [9, 'Ed Klondike', 'M', 52, 'OH', '81TC00', 'Laptop', 649.99,
        122.34, 'Email', 'July', 2018],
       [10, 'Phil Jones', 'M', 56, 'WV', 'M01-F0024', 'Desktop', 479.99,
        143.39, 'Flyer 2', 'August', 2018],
       [11, 'Rick James', 'M', 49, 'PA', 'GA401IV', 'Laptop', 1349.99,
        180.34, 'Flyer 3', 'November', 2018],
       [12, 'Sue Etna', 'F', 54, 'OH', 'GT13-0024', 'Desktop', 1249.99,
        230.89, 'Flyer 2', 'November', 2018],
       [13, 'Jason Case', 'M', 57, 'PA', '81TC00', 'Laptop', 649.99,
        122.34, 'Email', 'November', 2018],
       [14, 'Doug Johnson', 'M', 51, 'PA', 'I3670', 'Desktop', 649.99,
        118.64, 'Website', 'December', 2018],
       [15, 'Andy Sands', 'M', 56, 'OH', 'MY2J2LL', 'Tablet', 999.99,
        146.69, 'Flyer 1', 'December', 2018],
       [16, 'Kim Collins', 'F', 49, 'PA', 'I3593', 'Laptop', 399.99,
        72.09, 'Flyer 2', 'January', 2019],
       [17, 'Edna Sanders', 'F', 46, 'OH', '15M-ED', 'Laptop', 699.99,
        98.09, 'Email', 'February', 2019],
       [18, 'Michelle Samms', 'F', 46, 'NY', 'MY2J2LL', 'Tablet', 999.99,
        146.69, 'Website', 'March', 2019],
       [19, 'Mick Roberts', 'M', 23, 'PA', 'I3593', 'Laptop', 399.99,
        72.09, 'Flyer 4', 'March', 2019],
       [20, 'Sally Struthers', 'F', 45, 'NY', '81TC00', 'Laptop', 649.99,
        122.34, 'Website', 'April', 2019],
       [21, 'Jason Case', 'M', 57, 'PA', 'M01-F0024', 'Desktop', 479.99,
        143.39, 'Flyer 4', 'May', 2019],
       [22, 'Doug Johnson', 'M', 51, 'PA', 'GA401IV', 'Laptop', 1349.99,
        180.34, 'Website', 'August', 2019],
       [23, 'Paul Thomas', 'M', 43, 'OH', '81TC00', 'Laptop', 649.99,
        122.34, 'Website', 'August', 2019],
       [24, 'Margo Simms', 'F', 37, 'WV', 'Q526FA', 'Laptop', 1049.99,
        143.09, 'Flyer 4', 'November', 2019],
       [25, 'Michelle Samms', 'F', 46, 'NY', 'I3670', 'Desktop', 649.99,
        118.64, 'Flyer 2', 'November', 2019],
       [26, 'Mick Roberts', 'M', 23, 'PA', 'Q526FA', 'Laptop', 1049.99,
        143.09, 'Email', 'November', 2019],
       [27, 'Ed Klondike', 'M', 52, 'OH', 'Q526FA', 'Laptop', 1049.99,
        143.09, 'Website', 'December', 2019],
       [28, 'Moe Eggert', 'M', 35, 'PA', '15M-ED', 'Laptop', 699.99,
        98.09, 'Email', 'December', 2019],
       [29, 'Jessica Elk', 'F', 55, 'PA', 'GA401IV', 'Laptop', 1349.99,
        180.34, 'Flyer 2', 'December', 2019],
       [30, 'Phil Jones', 'M', 56, 'WV', 'M01-F0024', 'Desktop', 479.99,
        143.39, 'Flyer 2', 'January', 2020],
       [31, 'Rick James', 'M', 49, 'PA', 'GA401IV', 'Laptop', 1349.99,
        180.34, 'Flyer 1', 'January', 2020],
       [32, 'Sue Etna', 'F', 54, 'OH', 'GT13-0024', 'Desktop', 1249.99,
        230.89, 'Flyer 2', 'February', 2020],
       [33, 'Kim Collins', 'F', 49, 'PA', 'I3593', 'Laptop', 399.99,
        72.09, 'Flyer 2', 'March', 2020],
       [34, 'Edna Sanders', 'F', 46, 'OH', '15M-ED', 'Laptop', 699.99,
        98.09, 'Email', 'March', 2020],
       [35, 'Michelle Samms', 'F', 46, 'NY', 'MY2J2LL', 'Tablet', 999.99,
        146.69, 'Website', 'April', 2020],
       [36, 'Sally Struthers', 'F', 45, 'NY', '81TC00', 'Laptop', 649.99,
        122.34, 'Website', 'April', 2020],
       [37, 'Jason Case', 'M', 57, 'PA', 'M01-F0024', 'Desktop', 479.99,
        143.39, 'Flyer 4', 'April', 2020],
       [38, 'Doug Johnson', 'M', 51, 'PA', 'GA401IV', 'Laptop', 1349.99,
        180.34, 'Website', 'May', 2020],
       [39, 'Moe Eggert', 'M', 35, 'PA', 'I3593', 'Laptop', 399.99,
        72.09, 'Website', 'May', 2020]], dtype=object)

In [ ]:
### create series from data frame; note that index=[] is omitted here
pd.Series(df_cs['Contact'].values)

In [63]:
### we are using Sale ID as index and it starts from 1 instead of 0
pd.Series(df_cs['Contact'].values, index=df_cs['Sale ID'])

Sale ID
1         Paul Thomas
2         Margo Simms
3           Sam Stine
4          Moe Eggert
5         Jessica Elk
6     Sally Struthers
7      Michelle Samms
8        Mick Roberts
9         Ed Klondike
10         Phil Jones
11         Rick James
12           Sue Etna
13         Jason Case
14       Doug Johnson
15         Andy Sands
16        Kim Collins
17       Edna Sanders
18     Michelle Samms
19       Mick Roberts
20    Sally Struthers
21         Jason Case
22       Doug Johnson
23        Paul Thomas
24        Margo Simms
25     Michelle Samms
26       Mick Roberts
27        Ed Klondike
28         Moe Eggert
29        Jessica Elk
30         Phil Jones
31         Rick James
32           Sue Etna
33        Kim Collins
34       Edna Sanders
35     Michelle Samms
36    Sally Struthers
37         Jason Case
38       Doug Johnson
39         Moe Eggert
dtype: object

In [41]:
### create a dictionary
dict = {'one': pd.Series([1.,2.,3.], index=['a','b','c']), 
        'two': pd.Series([1.,2.,3.,4.], index=['a','b','c','d'])
       }

### create a dataframe from the dictionary
df=pd.DataFrame(dict)
print(df)

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [44]:
### replacing NaN with 0
print(df.fillna(0))

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  0.0  4.0

In [46]:
### pandas dataframe iloc == integer location
df.iloc[1]

one    2.0
two    2.0
Name: b, dtype: float64

In [56]:
### use inplace so that d:one is an integer
### add, sub function of df
df.fillna(0, inplace=True)
row = df.iloc[1]
df_add_row = df.add(row, axis='columns')
print(df_add_row)
col = df['two']
df.sub(col, axis=0)

   one  two
a  3.0  3.0
b  4.0  4.0
c  5.0  5.0
d  2.0  6.0

   one  two
a  0.0  0.0
b  0.0  0.0
c  0.0  0.0
d -4.0  0.0

In [59]:
### is df empty?
### see: https://pandas.pydata.org/docs/reference/frame.html
df.empty

False

In [62]:
##### transform
pd.DataFrame({'A': range(3), 'B': range(1,4)})

   A  B
0  0  1
1  1  2
2  2  3

In [65]:
df = pd.DataFrame({'A': range(3), 'B': range(1,4)})
df.transform(lambda x: x+1)

   A  B
0  1  2
1  2  3
2  3  4

In [68]:
##### here we need numpy
import numpy as np
df.transform(lambda x: np.sqrt(x))

          A         B
0  0.000000  1.000000
1  1.000000  1.414214
2  1.414214  1.732051

In [71]:
### use list for multiple transform
df.transform([lambda x: x**2, lambda x: x**3])

         A        B
  <lambda> <lambda>
0        0        1
1        1        8
2        8       27

In [73]:
##### passing a dictionary (instead of a list) to allow different calculation on different calls
df.transform({'A': lambda x: x**2, 'B': lambda x: x**3})

   A   B
0  0   1
1  1   8
2  4  27

In [74]:
### performing a function on a series
df['A'].map(lambda x: x**2)

0    0
1    1
2    4
Name: A, dtype: int64

In [76]:
### for a df, 
df.applymap(lambda x: x**2)

/var/folders/6t/bfp06fh96wn60n_mjtxmbhfm0000gn/T/ipykernel_74148/1911323247.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda x: x**2)

   A  B
0  0  1
1  1  4
2  4  9

In [90]:
### use the dict again
### create a dictionary (because we should use different variable names)
dict = {'one': pd.Series([1.,2.,3.], index=['a','b','c']), 
        'two': pd.Series([1.,2.,3.,4.], index=['a','b','c','d'])
       }
### create a dataframe from the dictionary
df=pd.DataFrame(dict)

### take a look at the dict
print(df)

### get unique values
df['two'].unique()

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

array([1., 2., 3., 4.])

In [87]:
### num of 
df['two'].nunique()

4

In [94]:
### value count
col_one = df['one'].value_counts()
print(col_one)
df['two'].value_counts()

one
1.0    1
2.0    1
3.0    1
Name: count, dtype: int64

two
1.0    1
2.0    1
3.0    1
4.0    1
Name: count, dtype: int64

In [95]:
### column names (they are attributes)
cols = df.columns
print(cols)
### get index
df.index

Index(['one', 'two'], dtype='object')

Index(['a', 'b', 'c', 'd'], dtype='object')

In [91]:
### we have a NaN, so...
df.isnull()
##### note this is different from 41:26 of https://www.youtube.com/watch?v=PcvsOaixUh8&list=PLGLfVvz_LVvQy4mkmEvtFwZGg1S38MUmn&index=10&ab_channel=DerekBanas

     one    two
a  False  False
b  False  False
c  False  False
d   True  False